Revit 2026 API

# GenericZoneDomainData Properties

---

The GenericZoneDomainData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

#### Reference

GenericZoneDomainData Class

Autodesk.Revit.DB.Analysis Namespace